# 岸桥和平板车的对应关系
WORK_LINE = {
    'Q107': ['A548', 'A549', 'A550', 'A551', 'A552', 'A553', 'A554'],
    'Q108': ['A541', 'A542', 'A543', 'A544', 'A545', 'A546', 'A547', ],
    'Q109': ['A520', 'A521', 'A522', 'A523', 'A524', 'A525', 'A526', ],
    'Q110': ['A527', 'A528', 'A529', 'A530', 'A531', 'A532', 'A533', ],
    'Q111': ['A534', 'A535', 'A536', 'A537', 'A538', 'A539', 'A540', ]  #
}
CHE_IDS = [
    'A520',
    'A521',
    'A522',
    'A523',
    'A524',
    'A525',
    'A526',
    'A527',
    'A528',
    'A529',
    'A530',
    'A531',
    'A532',
    'A533',
    'A534',
    'A535',
    'A536',
    'A537',
    'A538',
    'A539',
    'A540',
    'A541',
    'A542',
    'A543',
    'A544',
    'A545',
    'A546',
    'A547',
    'A548',
    'A549',
    'A550',
    'A551',
    'A552',
    'A553',
    'A554',
]

# TZ --- 堆场入口、  TP --- 作业位置
# PSTP --- 装船锁站和卸船锁站、 QCTP -- 去岸桥、 YCTP --- 去堆场

# 所有的岸桥列表
bridges_all = ['Q107', 'Q108', 'Q109', 'Q110', 'Q111', ]

# putjpos和containers里的position的对应关系，集装箱在车上的位置，是车辆点位判断依据之一
putjpos_dict = {
    '1': 'FWD',  # 前
    '2': 'CTR',  # 中
    '3': 'AFT',  # 后
}

# form_id和dest_type的对应关系
from_id = {
    '1': "FORM_TRUCK_EMPTY_TO_ORIGIN",  # 空载去起点
    '2': "PSTP ",
    '6': "FORM_TRUCK_LADEN_TO_DEST",  # 重载去终点
}

# business_Type和mvkd的对应关系
business_type = {
    '1': 'LOAD',  # 装船
    '2': 'DSCH',  # 卸船
    '3': 'YARD_MOVE',  # 移船
}

# redis数据库配置
redis_host = '10.188.73.101'
redis_port = 6379
redis_password = "Trunk@123"  # 如果你的Redis服务器有密码，请在这里填写密码
redis_db = 0  # Redis数据库索引，默认为0
